index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-04 Thu 21:57 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multi- to Monorepo Migration</title>
<meta name="description" content="Migrate your multirepo to a monorepo using a bash script" />
<meta name="generator" content="Org Mode" />
<link rel=stylesheet href=./style.css>
<meta name=color-scheme content="light dark">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Multi- to Monorepo Migration</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb117a0c">1. Features</a></li>
<li><a href="#org2849d0f">2. Usage</a>
<ul>
<li><a href="#org1fecdd7">2.1. Custom name for monorepo directory</a></li>
<li><a href="#org0bd1bd7">2.2. Custom “master” / “main” branch name</a></li>
<li><a href="#orgad396f1">2.3. Continue existing migration</a></li>
<li><a href="#org3f13c04">2.4. Tags</a>
<ul>
<li><a href="#org7b01d18">2.4.1. Lightweight vs. Annotated Tags</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#example">3. Example</a>
<ul>
<li><a href="#org473f2ed">3.1. Initial setup of fake repos</a></li>
<li><a href="#org688e8d1">3.2. Combine into monorepo</a></li>
<li><a href="#org569a79f">3.3. Pull in new changes from a remote</a></li>
<li><a href="#orge0c76bf">3.4. Continue</a></li>
</ul>
</li>
<li><a href="#org0798e52">4. Implementation</a>
<ul>
<li><a href="#org50b292d">4.1. Per repository</a></li>
<li><a href="#orgc8b5387">4.2. Per branch (this is where the magic happens)</a>
<ul>
<li><a href="#orga770f49">4.2.1. Ensure we are on the right branch</a></li>
<li><a href="#org06fa148">4.2.2. Non-goal: merging into root</a></li>
</ul>
</li>
<li><a href="#orge9dedb2">4.3. Set up the monorepo directory</a></li>
<li><a href="#orgc2e9f5d">4.4. List individual branches</a>
<ul>
<li><a href="#org7e92ece">4.4.1. Implementations that didn’t make the cut</a></li>
</ul>
</li>
<li><a href="#org5395b7e">4.5. Init &amp; finalize</a>
<ul>
<li><a href="#orgafaccc4">4.5.1. Error flags, warnings, debug</a></li>
<li><a href="#orgf38700c">4.5.2. Windows newline fix</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfb16f0e">5. Tests</a></li>
<li><a href="#org9ca6cee">6. Copyright and license</a></li>
</ul>
</div>
</nav>
<p>
This script merges multiple independent tiny repositories into a single &ldquo;monorepo&rdquo;. The summary is “every repo is moved into its own subdirectory, branches are merged.” See <a href="#example">Example</a> for the details.
</p>

<p>
Further reading: <a href="https://syslog.ravelin.com/multi-to-mono-repository-c81d004df3ce">https://syslog.ravelin.com/multi-to-mono-repository-c81d004df3ce</a>
</p>

<div id="outline-container-orgb117a0c" class="outline-2">
<h2 id="orgb117a0c"><span class="section-number-2">1.</span> Features</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>🕙 Full history of all your prior repos is intact, no changes to checksums</li>
<li>#️⃣ Signatures of old repos stay valid</li>
<li>🔁 Create the monorepo and keep pulling in changes from your minirepos later</li>
<li>🔀 Pull in entire new repos as you go, no need to prepare the whole thing at once</li>
<li>🏷 Tags are namespaced to avoid clashes, but tag signatures remain valid</li>
<li>🉑 Branches with weird names (slashes, etc)</li>
<li>👥 No conflicts between files with the same name</li>
<li>📁 Every project gets its own subdirectory</li>
</ul>
</div>
</div>

<div id="outline-container-org2849d0f" class="outline-2">
<h2 id="org2849d0f"><span class="section-number-2">2.</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Run the <code>tomono</code> script with your config on stdin, in the following format:
</p>

<pre class="example" id="org7cd4356">
$ cat my-repos.txt
git@github.com:mycompany/my-repo-abc.git  abc
git@github.com:mycompany/my-repo-def.git  def
git@github.com:mycompany/my-lib-uuu.git   uuu  lib/uuu
git@github.com:mycompany/my-lib-zzz.git   zzz  lib/zzz
</pre>

<p>
Concrete example:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cat my-repos.txt | /path/to/tomono
</pre>
</div>

<p>
That should be all ✅.
</p>
</div>

<div id="outline-container-org1fecdd7" class="outline-3">
<h3 id="org1fecdd7"><span class="section-number-3">2.1.</span> Custom name for monorepo directory</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Don’t like <code>core</code>? Set a different name through an envvar before running the script:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">export</span> <span class="org-variable-name">MONOREPO_NAME</span>=the-big-repo
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bd1bd7" class="outline-3">
<h3 id="org0bd1bd7"><span class="section-number-3">2.2.</span> Custom “master” / “main” branch name</h3>
<div class="outline-text-3" id="text-2-2">
<p>
No need to do anything. This script does not handle any master / main branch in any special way. It just merges whatever branches exist. Don’t have a “master” branch? None will be created.
</p>

<p>
Make sure your own computer has the right branch set up in its <code>init.defaultBranch</code> setting.
</p>
</div>
</div>

<div id="outline-container-orgad396f1" class="outline-3">
<h3 id="orgad396f1"><span class="section-number-3">2.3.</span> Continue existing migration</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Large teams can’t afford to “stop the world” while a migration is in progress. You’ll be fixing stuff and pulling in new repositories as you go.
</p>

<p>
Here’s how to pull in an entirely new set of repositories:
</p>

<div class="org-src-container">
<pre class="src src-shell">/path/to/tomono --continue &lt; my-new-repos.txt
</pre>
</div>

<p>
Make sure you have your environment set up exactly the same as above. Particularly, you must be in the parent dir of the monorepo.
</p>
</div>
</div>

<div id="outline-container-org3f13c04" class="outline-3">
<h3 id="org3f13c04"><span class="section-number-3">2.4.</span> Tags</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Tags are namespaced per remote, to avoid clashes. If your remote <code>foo</code> and <code>bar</code> both have a tag <code>v1.0.0</code>, your monorepo ends up with <code>foo/v1.0.0</code> and <code>bar/v1.0.0</code> pointing at their relevant commits.
</p>

<p>
If you don’t like this rewriting, you can fetch all tags from a specific remote to the top-level of the monorepo:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git fetch --tags foo
</pre>
</div>

<p>
Be prepared to deal with any conflicts.
</p>
</div>

<div id="outline-container-org7b01d18" class="outline-4">
<h4 id="org7b01d18"><span class="section-number-4">2.4.1.</span> Lightweight vs. Annotated Tags</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
N.B.: This namespacing works for all tags: lightweight, annotated, signed. However, for the latter two, there is one snag: an annotated tag contains its own tag name as part of the commit. I have chosen not to modify the object itself, so the annotated tag object thinks it still has its old name. This is a mixed bag: it depends on your case whether that’s a feature or a bug. One major advantage of this approach is that signed tags remain valid. But you will occasionally get messages like:
</p>

<pre class="example" id="org08f5bb9">
$ git describe linux/v5.9-rc4
warning: tag 'linux/v5.9-rc4' is externally known as 'v5.9-rc4'
v5.9-rc4-0-gf4d51dffc6c0
</pre>

<p>
If you know what you’re doing, you can force update all signed and annotated tags to their (nested) ref tag name with the following snippet:
</p>

<div class="org-src-container">
<pre class="src src-shell">git for-each-ref --format <span class="org-string">'%(objecttype) %(refname:lstrip=2)'</span> | <span class="org-sh-escaped-newline">\</span>
    sed -ne <span class="org-string">'s/^tag //p'</span> |
    <span class="org-variable-name">GIT_EDITOR</span>=true xargs -I + -n 1 -- git tag -f -a + +^{}
</pre>
</div>

<p>
N.B.: this will convert all signed tags to regular annotated tags (their signatures would fail anyway).
</p>

<p>
Source: <a href="https://github.com/mwasilew2/tomono/commit/16aa7918aa9d912a30b563152bda62c77414cbe1">GitHub user mwasilew2</a>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-example" class="outline-2">
<h2 id="example"><span class="section-number-2">3.</span> Example</h2>
<div class="outline-text-2" id="text-example">
<p>
Run these commands to set up a fresh directory with git monorepos that you can later merge:
</p>
</div>
