index.html

<div id="outline-container-org473f2ed" class="outline-3">
<h3 id="org473f2ed"><span class="section-number-3">3.1.</span> Initial setup of fake repos</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">d</span>=<span class="org-string">"$(mktemp -d)"</span>
<span class="org-builtin">echo</span> <span class="org-string">"Setting up fresh multi-repos in $d"</span>
<span class="org-builtin">cd</span> <span class="org-string">"$d"</span>

mkdir foo
(
    <span class="org-builtin">cd</span> foo
    git init
    git commit -m <span class="org-string">"foo&#8217;s empty root"</span> --allow-empty
    <span class="org-builtin">echo</span> <span class="org-string">"This is foo"</span> &gt; i-am-foo.txt
    git add -A
    git commit -m <span class="org-string">"foo&#8217;s master"</span>
    git tag v1.0
    git checkout -b branch-a
    <span class="org-builtin">echo</span> <span class="org-string">"I am a new foo feature"</span> &gt; feature-a.txt
    git add -A
    git commit -m <span class="org-string">"foo&#8217;s feature branch A"</span>
)

mkdir bar
(
    <span class="org-builtin">cd</span> bar
    git init
    <span class="org-builtin">echo</span> <span class="org-string">"This is bar"</span> &gt; i-am-bar.txt
    git add -A
    git commit -m <span class="org-string">"bar&#8217;s master"</span>
    git tag v1.0
    git checkout -b branch-a
    <span class="org-builtin">echo</span> <span class="org-string">"I am bar&#8217;s side of feature A"</span> &gt; feature-a.txt
    git add -A
    git commit -m <span class="org-string">"bar&#8217;s feature branch A"</span>
    git branch branch-b master
    git checkout branch-b
    <span class="org-builtin">echo</span> <span class="org-string">"I am an entirely new feature of bar: B"</span> &gt; feature-b.txt
    git add -A
    git commit -m <span class="org-string">"bar&#8217;s feature branch B"</span>
)
</pre>
</div>

<p>
You now have two directories:
</p>

<ul class="org-ul">
<li><code>foo</code> (branches: <code>master</code>, <code>branch-a</code>)</li>
<li><code>bar</code> (branches: <code>master</code>, <code>branch-a</code>, <code>branch-b</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org688e8d1" class="outline-3">
<h3 id="org688e8d1"><span class="section-number-3">3.2.</span> Combine into monorepo</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Assuming the <code>tomono</code> script is in your <code>$PATH</code>, you can invoke it like this, from that same directory:
</p>

<div class="org-src-container">
<pre class="src src-shell">tomono &lt;&lt;EOF
<span class="org-sh-heredoc">$PWD/foo foo</span>
<span class="org-sh-heredoc">$PWD/bar bar</span>
<span class="org-sh-heredoc">EOF</span>
</pre>
</div>

<p>
This will create a new directory, <code>core</code>, where you can find a git tree which looks somewhat like this:
</p>

<pre class="example" id="org2a8da2e">
*   Merge foo/branch-a (branch-a)
|\
| * foo’s feature branch A (foo/branch-a)
* |   Merge bar/branch-a
|\ \
| * | bar’s feature branch A (bar/branch-a)
* | | Root commit for monorepo branch branch-a
 / /
| | *   Merge foo/master (HEAD -&gt; master)
| | |\
| | |/
| |/|
| * | foo’s master (tag: foo/v1.0, foo/master)
| * | foo’s empty root
|  /
| *   Merge bar/master
| |\
| |/
|/|
| * Root commit for monorepo branch master
|
| *   Merge bar/branch-b (branch-b)
| |\
| | * bar’s feature branch B (bar/branch-b)
| |/
|/|
* | bar’s master (tag: bar/v1.0, bar/master)
 /
* Root commit for monorepo branch branch-b
</pre>
</div>
</div>

<div id="outline-container-org569a79f" class="outline-3">
<h3 id="org569a79f"><span class="section-number-3">3.3.</span> Pull in new changes from a remote</h3>
<div class="outline-text-3" id="text-3-3">
<p>
It’s possible that while you’re working on setting up your fresh monorepo, new changes have been pushed to the existing single repos:
</p>

<div class="org-src-container">
<pre class="src src-shell">(
        <span class="org-builtin">cd</span> foo
        <span class="org-builtin">echo</span> New changes &gt;&gt; i-am-foo.txt
        git commit -va -m <span class="org-string">'New changes to foo'</span>
)
</pre>
</div>

<p>
Because their history was imported verbatim and nothing has been rewritten, you can import those changes into the monorepo.
</p>

<p>
First, fetch the changes from the remote:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cd core
$ git fetch foo
</pre>
</div>

<p>
Now merge your changes using subtree merge:
</p>

<div class="org-src-container">
<pre class="src src-shell">git checkout master
git merge -X <span class="org-variable-name">subtree</span>=foo/ foo/master
</pre>
</div>

<p>
And the updates should be reflected in the monorepo:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cat foo/i-am-foo.txt
This is foo
New changes
</pre>
</div>

<p>
I used the branch master in this example, but any branch works the same way.
</p>
</div>
</div>

<div id="outline-container-orge0c76bf" class="outline-3">
<h3 id="orge0c76bf"><span class="section-number-3">3.4.</span> Continue</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Now imagine you want to pull in a third repository into the monorepo:
</p>

<div class="org-src-container">
<pre class="src src-shell">mkdir zimlib
(
    <span class="org-builtin">cd</span> zimlib
    git init
    <span class="org-builtin">echo</span> <span class="org-string">"This is zim"</span> &gt; i-am-zim.txt
    git add -A
    git commit -m <span class="org-string">"zim&#8217;s master"</span>
    git checkout -b branch-a
    <span class="org-builtin">echo</span> <span class="org-string">"I am a new zim feature"</span> &gt; feature-a.txt
    git add -A
    git commit -m <span class="org-string">"zim&#8217;s feature branch A"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">And some more weird stuff, to mess with you</span>
    git checkout master
    git checkout -d
    <span class="org-builtin">echo</span> top secret &gt; james-bond.txt
    git add -A
    git commit -m <span class="org-string">"I am unreachable"</span>
    git tag leaking-you HEAD
    git checkout --orphan empty-branch
    git rm --cached -r .
    git clean -dfx
    git commit -m <span class="org-string">"zim&#8217;s tricky empty orphan branch"</span> --allow-empty
)
</pre>
</div>

<p>
Continue importing it:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">echo</span> <span class="org-string">"$PWD/zimlib zim lib/zim"</span> | tomono --continue
</pre>
</div>

<p>
Note that we used a different name for this subrepo, inside the <code>lib</code> dir.
</p>

<p>
The result is that it gets imported into the existing monorepo, alongside the existing two projects:
</p>

<pre class="example" id="org60fb25e">
$ cd core
$ git checkout master
Switched to branch 'master'
$ tree
.
├── bar
│   └── i-am-bar.txt
├── foo
│   └── i-am-foo.txt
└── lib
    └── zim
        └── i-am-zim.txt

4 directories, 3 files
$ git checkout branch-a
Switched to branch 'branch-a'
$ tree
.
├── bar
│   ├── feature-a.txt
│   └── i-am-bar.txt
├── foo
│   ├── feature-a.txt
│   └── i-am-foo.txt
└── lib
    └── zim
        ├── feature-a.txt
        └── i-am-zim.txt

4 directories, 6 files
$ head **/feature-a.txt
==&gt; bar/feature-a.txt &lt;==
I am bar’s side of feature A

==&gt; foo/feature-a.txt &lt;==
I am a new foo feature

==&gt; lib/zim/feature-a.txt &lt;==
I am a new zim feature
</pre>
</div>
</div>
</div>

<div id="outline-container-org0798e52" class="outline-2">
<h2 id="org0798e52"><span class="section-number-2">4.</span> Implementation</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
(This section is best viewed at <a href="https://tomono.0brg.net/">https://tomono.0brg.net/</a>, the GitHub Readme viewer misses some info)
</p>
</blockquote>

<p>
The outer program structure is a flat bash script which loops over every repo supplied over stdin:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>top-level</label><pre class="src src-shell" id="org4fa40cd">&lt;&lt;init&gt;&gt;

<span class="org-comment-delimiter"># </span><span class="org-comment">Note this is top-level in the script so it&#8217;s reading from the script&#8217;s stdin</span>
<span class="org-keyword">while</span> &lt;&lt;windows-fix&gt;&gt; read repourl reponame repopath; <span class="org-keyword">do</span>
<span class="org-sh-heredoc">    if [[ -z "$repopath" ]]; then</span>
<span class="org-sh-heredoc">        repopath="$reponame"</span>
<span class="org-sh-heredoc">    fi</span>

<span class="org-sh-heredoc">    &lt;&lt;handle-remote&gt;&gt;</span>
<span class="org-sh-heredoc">done</span>

<span class="org-sh-heredoc">&lt;&lt;finalize&gt;&gt;</span>

<span class="org-sh-heredoc"># &lt;&lt;copyright&gt;&gt;</span>
</pre>
</div>
<p>
References: <a href="#org88df996">init</a>, <a href="#orgc3a68fc">windows-fix</a>, <a href="#org54bc56b">handle-remote</a>, <a href="#orgd941131">finalize</a>, <a href="#orgef9bc8e">copyright</a>
</p>
</div>
