index.html


<div id="outline-container-org50b292d" class="outline-3">
<h3 id="org50b292d"><span class="section-number-3">4.1.</span> Per repository</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Every repository is fetched and fully handled individually, and sequentially:
</p>

<ol class="org-ol">
<li>fetch all the data related to this repository,</li>
<li>immediately check out and initialise every single branch which belongs to that repository.</li>
</ol>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>handle-remote</label><pre class="src src-shell" id="org54bc56b">git remote add <span class="org-string">"$reponame"</span> <span class="org-string">"$repourl"</span>
git config --add <span class="org-string">"remote.$reponame.fetch"</span> <span class="org-string">"+refs/tags/*:refs/tags/$reponame/*"</span>
git config <span class="org-string">"remote.$reponame.tagOpt"</span> --no-tags
git fetch --atomic <span class="org-string">"$reponame"</span>

&lt;&lt;list-branches&gt;&gt; | <span class="org-keyword">while </span><span class="org-builtin">read</span> branch ; <span class="org-keyword">do</span>
<span class="org-sh-heredoc">    &lt;&lt;handle-branch&gt;&gt;</span>
<span class="org-sh-heredoc">done</span>
</pre>
</div>
<p>
References: <a href="#org0337cf8">list-branches</a>, <a href="#org06289df">handle-branch</a>
</p>

<p>
Used by: <a href="#org4fa40cd">top-level</a>
</p>


<p>
The remotes are configured to make sure that a default fetch always fetch all tags, and also puts them in their own namespace. The default refspec for tags is <code>+refs/tags/*:refs/tags/*</code>, as you can see that puts everything from the remote at the same level in your monorepo. Obviously that will cause clashes, so we add the reponame as an extra namespace.
</p>

<p>
The <code>--no-tags</code> option is the complement to <code>--tags</code>, which has that default refspec we don’t want. That’s why we disable it and roll our own, entirely.
</p>
</div>
</div>

<div id="outline-container-orgc8b5387" class="outline-3">
<h3 id="orgc8b5387"><span class="section-number-3">4.2.</span> Per branch (this is where the magic happens)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
In the context of <i>a single repository check-out</i>, every branch is independently checked out into a subdir for that repository, and merged into the monorepo.
</p>

<p>
This is the money shot.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>handle-branch</label><pre class="src src-shell" id="org06289df">&lt;&lt;ensure-on-target-branch-in-monorepo&gt;&gt;

git merge --strategy=ours <span class="org-string">"$reponame/$branch"</span> --allow-unrelated-histories --no-commit --no-ff
git read-tree --prefix <span class="org-string">"$repopath"</span> <span class="org-string">"$reponame/$branch"</span>
git commit -m <span class="org-string">"Merge $reponame/$branch"</span> --allow-empty
</pre>
</div>
<p>
References: <a href="#orgfb57a20">ensure-on-target-branch-in-monorepo</a>
</p>

<p>
Used by: <a href="#org54bc56b">handle-remote</a>
</p>


<p>
Source: <a href="https://git-scm.com/book/en/v2/Git-Internals-Git-Objects">https://git-scm.com/book/en/v2/Git-Internals-Git-Objects</a>
</p>

<p>
Technically, it’s not actually “checked out”: that implies changing the files in your work tree, i.e. on disk. Rather only the index is changed.
</p>
</div>

<div id="outline-container-orga770f49" class="outline-4">
<h4 id="orga770f49"><span class="section-number-4">4.2.1.</span> Ensure we are on the right branch</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
In this snippet, we ensure that we are ready to merge fresh code from a subrepo into this branch: either we checkout an existing branch in the monorepo by this name, or we create a fresh one.
</p>

<p>
We are given the variable <code>$branch</code> which is the final name of the branch we want to operate on. It is the same as the name of the branch in each individual target repo.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>ensure-on-target-branch-in-monorepo</label><pre class="src src-shell" id="orgfb57a20"><span class="org-keyword">if</span> <span class="org-negation-char">!</span> git show-ref --verify --quiet <span class="org-string">"refs/heads/$branch"</span>; <span class="org-keyword">then</span>
    git branch -- <span class="org-string">"$branch"</span> <span class="org-string">"$(printf "Root commit for monorepo branch %s" "$branch" | git commit-tree "$empty_tree")"</span>
<span class="org-keyword">fi</span>
git symbolic-ref HEAD <span class="org-string">"refs/heads/$branch"</span>
git reset
</pre>
</div>
<p>
Used by: <a href="#org06289df">handle-branch</a>
</p>


<p>
Instead of using <code>git checkout --orphan</code> and trying to create a new empty commit from the index, we create the empty commit first, and update the HEAD to it directly. This lets us stay entirely in the index without bothering with the work tree.
</p>

<p>
Sources:
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/q/9765453/4359699">https://stackoverflow.com/q/9765453/4359699</a></li>
<li><a href="https://stackoverflow.com/a/6070417/4359699">https://stackoverflow.com/a/6070417/4359699</a></li>
</ul>
</div>
</div>

<div id="outline-container-org06fa148" class="outline-4">
<h4 id="org06fa148"><span class="section-number-4">4.2.2.</span> Non-goal: merging into root</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
GitHub user @woopla proposed in <a href="https://github.com/hraban/tomono/pull/42">#42</a> the ability to merge a minirepo into the monorepo root, as if you used <code>.</code> as the subdirectory. We ended up not going for it, but it was interesting to investigate how to do this with <code>git read-tree</code>. The closest I got was:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">if</span> [[ <span class="org-string">"$repopath"</span> == <span class="org-string">"."</span> ]]; <span class="org-keyword">then</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Experimental&#8212;is this how git read-tree works? I find it very confusing.</span>
    git read-tree <span class="org-string">"$branch"</span> <span class="org-string">"$reponame/$branch"</span>
<span class="org-keyword">else</span>
    git read-tree --prefix <span class="org-string">"$repopath"</span> <span class="org-string">"$reponame/$branch"</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
I must to confess I find the <a href="https://git-scm.com/docs/git-read-tree">git read-tree</a> man page too daunting to fully stand by this. I mostly figured it out by trial and error. It seems to work?
</p>

<p>
If anyone could explain to me exactly what this tool is supposed to do, what those separate stages are (it talks about “stage 0” to “stage 3” in its 3 way merge), and how you would cleanly do this, just for argument’s sake, I’d love to know.
</p>

<p>
But, as it turned out, this tool already has a way to merge a repo into the root: just make it the monorepo, and use it as a target for a <code>--continue</code> operation. That solves that.
</p>
</div>
</div>
</div>
