index.html

<div id="outline-container-orge9dedb2" class="outline-3">
<h3 id="orge9dedb2"><span class="section-number-3">4.3.</span> Set up the monorepo directory</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We create a fresh directory for this script to run in, or continue on an existing one if the <code>--continue</code> flag is passed.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>prep-dir</label><pre class="src src-shell" id="orgeb25a28"><span class="org-comment-delimiter"># </span><span class="org-comment">Poor man&#8217;s arg parse :/</span>
<span class="org-variable-name">arg</span>=<span class="org-string">"${1-}"</span>
: <span class="org-string">"${MONOREPO_NAME:=core}"</span>

<span class="org-keyword">if</span> [[ <span class="org-string">"$arg"</span> == <span class="org-string">""</span> ]]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> [[ -d <span class="org-string">"$MONOREPO_NAME"</span> &amp;&amp; <span class="org-string">"$arg"</span> != <span class="org-string">"--continue"</span> ]]; <span class="org-keyword">then</span>
                &gt;&amp;2 echo <span class="org-string">"monorepo directory $MONOREPO_NAME already exists"</span>
                <span class="org-keyword">exit</span> 1
        <span class="org-keyword">fi</span>
        mkdir <span class="org-string">"$MONOREPO_NAME"</span>
        <span class="org-builtin">cd</span> <span class="org-string">"$MONOREPO_NAME"</span>
        git init
<span class="org-keyword">elif</span> [[ <span class="org-string">"$arg"</span> != <span class="org-string">"--continue"</span> ]]; <span class="org-keyword">then</span>
        &gt;&amp;2 echo <span class="org-string">"Unexpected argument: $arg"</span>
        &gt;&amp;2 echo
        &gt;&amp;2 echo <span class="org-string">"Usage: $0 [--continue]"</span>
        <span class="org-keyword">exit</span> 1
<span class="org-keyword">elif</span> [[ <span class="org-negation-char">!</span> -d <span class="org-string">"$MONOREPO_NAME"</span> ]]; <span class="org-keyword">then</span>
        &gt;&amp;2 echo <span class="org-string">"Asked to --continue, but monorepo directory $MONOREPO_NAME doesn&#8217;t exist"</span>
        <span class="org-keyword">exit</span> 1
<span class="org-keyword">else</span>
        <span class="org-builtin">cd</span> <span class="org-string">"$MONOREPO_NAME"</span>
        <span class="org-keyword">if</span> git status --porcelain | grep . ; <span class="org-keyword">then</span>
                &gt;&amp;2 echo <span class="org-string">"Git status shows pending changes in the repo. Cannot --continue."</span>
                <span class="org-keyword">exit</span> 1
        <span class="org-keyword">fi</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">There isn&#8217;t anything special about --continue, really.</span>
<span class="org-keyword">fi</span>
</pre>
</div>
<p>
Used by: <a href="#org88df996">init</a>
</p>


<p>
Most of this rigmarole is about UI, and preventing mistakes. As you can see, there is functionally no difference between continuing and starting fresh, beyond <code>mkdir</code> and <code>git init</code>. At the end of the day, every repo is read in greedily, and whether you do that on an existing monorepo, or a fresh one, doesn’t matter: every repo name you read in, is in fact itself like a <code>--continue</code> operation.
</p>

<p>
It’s horrible and kludgy but I just want to get something working out the door, for now.
</p>
</div>
</div>

<div id="outline-container-orgc2e9f5d" class="outline-3">
<h3 id="orgc2e9f5d"><span class="section-number-3">4.4.</span> List individual branches</h3>
<div class="outline-text-3" id="text-4-4">
<p>
I want a single branch name per line on stdout, for a single specific remote:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>list-branches</label><pre class="src src-shell" id="org0337cf8">git branch -r --no-color --list <span class="org-string">"$reponame/*"</span> --format <span class="org-string">"%(refname:lstrip=3)"</span>
</pre>
</div>
<p>
Used by: <a href="#org54bc56b">handle-remote</a>
</p>
</div>


<div id="outline-container-org7e92ece" class="outline-4">
<h4 id="org7e92ece"><span class="section-number-4">4.4.1.</span> Implementations that didn’t make the cut</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Solutions I abandoned, due to one short-coming or another:
</p>
</div>

<ol class="org-ol">
<li><a id="org8119584"></a><code>git branch -r</code> with grep<br>
<div class="outline-text-5" id="text-4-4-1-1">
<p>
The most straight-forward way to list branch names:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git branch -r
  bar/branch-a
  bar/branch-b
  bar/master
  foo/branch-a
  foo/master
</pre>
</div>

<p>
This could be combined with <code>grep</code> to filter all branches for a specific remote, and filter out the name. It’s very close, but how do you reliably remove an unknown string?
</p>
</div>
</li>

<li><a id="org1860b73"></a><code>find .git/refs/hooks</code><br>
<div class="outline-text-5" id="text-4-4-1-2">
<div class="org-src-container">
<pre class="src src-shell">( <span class="org-builtin">cd</span> <span class="org-string">".git/refs/remotes/$reponame"</span> &amp;&amp; find . -type f -mindepth 1 | sed -e s/..// )
</pre>
</div>

<p>
Closer, but ugly, and I got reports that it missed some branches (although I was never able to repro)
</p>
</div>
</li>

<li><a id="org4d25425"></a><code>git ls-remote</code><br>
<div class="outline-text-5" id="text-4-4-1-3">
<div class="org-src-container">
<pre class="src src-shell">git ls-remote --heads --refs <span class="org-string">"$reponame"</span> | sed <span class="org-string">'s_[^ ]* *refs/heads/__'</span>
</pre>
</div>

<p>
Originally suggested in a <a href="https://github.com/hraban/tomono/pull/39">PR 39</a>, I’ve decided not to use this because <code>git-ls-remote</code> actively queries the remote to list its branches, rather than inspecting the local state of whatever we just fetched. That feels like a race condition at best, and becomes very annoying if you’re dealing with password protected remotes or otherwise inaccessible repos.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org5395b7e" class="outline-3">
<h3 id="org5395b7e"><span class="section-number-3">4.5.</span> Init &amp; finalize</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Initialization is what you’d expect from a shell script:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>init</label><pre class="src src-shell" id="org88df996">&lt;&lt;set-flags&gt;&gt;

&lt;&lt;prep-dir&gt;&gt;

<span class="org-sh-heredoc">empty_tree="$(git hash-object -t tree /dev/null)"</span>
</pre>
</div>
<p>
References: <a href="#org8e0dfd3">set-flags</a>, <a href="#orgeb25a28">prep-dir</a>
</p>

<p>
Used by: <a href="#org4fa40cd">top-level</a>
</p>


<p>
On the other side, when done, update the working tree to whatever the current branch is to avoid any confusion:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>finalize</label><pre class="src src-shell" id="orgd941131">git checkout .
</pre>
</div>
<p>
Used by: <a href="#org4fa40cd">top-level</a>
</p>
</div>


<div id="outline-container-orgafaccc4" class="outline-4">
<h4 id="orgafaccc4"><span class="section-number-4">4.5.1.</span> Error flags, warnings, debug</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Various sh flags allow us to control the behaviour of the shell: treat
any unknown variable reference as an error, treat any non-zero exit
status in a pipeline as an error (instead of only looking at the last
program), and treat any error as fatal and quit. Additionally, if the
<code>DEBUGSH</code> environment variable is set, enable &ldquo;debug&rdquo; mode by echoing
every command before it gets executed.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>set-flags</label><pre class="src src-shell" id="org8e0dfd3"><span class="org-builtin">set</span> -euo pipefail ${<span class="org-variable-name">DEBUGSH</span>+-x}
</pre>
</div>
<p>
Used by: <a href="#org88df996">init</a>
</p>
</div>
</div>
