index.html

<div id="outline-container-org9ca6cee" class="outline-2">
<h2 id="org9ca6cee"><span class="section-number-2">6.</span> Copyright and license</h2>
<div class="outline-text-2" id="text-6">
<p>
This is a cleanroom reimplementation of the tomono.sh script, originally written with copyright assigned to Ravelin Ltd., a UK fraud detection company. There were some questions around licensing, and it was unclear how to go forward with maintenance of this project given its dispersed copyright, so I went ahead and rewrote the entire thing for a fresh start.
</p>

<p>
The license and copyright attribution of this entire document can now be set:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>copyright</label><pre class="src src-fundamental" id="orgef9bc8e">Copyright &#169; 2020, 2022 Hraban Luyat

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU Affero General Public License as
published by the Free Software Foundation, version 3 of the License.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU Affero General Public License for more details.

You should have received a copy of the GNU Affero General Public License
along with this program.  If not, see <a href="https://www.gnu.org/licenses/">&lt;https://www.gnu.org/licenses/&gt;</a>.
</pre>
</div>
<p>
Used by: <a href="#org4fa40cd">top-level</a>
</p>


<p>
I did not look at the original implementation at all while developing this.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-08-04 Thu 21:57</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
